In [1]:
import sys
import pandas as pd
sys.path.append("..")
from layzee.feature_generation import *

In [2]:
df = pd.read_csv('../data/titanic.csv')

In [3]:
res = pairwise_polynomial_combinations(df,['Age','Parch','Pclass'])
res.head()

[('Age', 'Parch'), ('Age', 'Pclass'), ('Parch', 'Pclass')]

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived,Age*Parch,Age*Pclass,Parch*Pclass
0,364,3,"Asim, Mr. Adola",male,35.0,0,0,SOTON/O.Q. 3101310,7.0500,NaN,S,0,35.0,38.0,3
1,60,3,"Goodwin, Master. William Frederick",male,11.0,5,2,CA 2144,46.9000,NaN,S,0,13.0,14.0,5
2,796,2,"Otter, Mr. Richard",male,39.0,0,0,28213,13.0000,NaN,S,0,39.0,41.0,2
3,738,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C,1,35.0,36.0,1
4,842,2,"Mudd, Mr. Thomas Charles",male,16.0,0,0,S.O./P.P. 3,10.5000,NaN,S,0,16.0,18.0,2

In [5]:
res = pairwise_linear_combinations(df,['Age','Parch'])
res.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived,Age*Parch,Age*Pclass,Parch*Pclass,Age+Parch,Age-Parch
0,364,3,"Asim, Mr. Adola",male,35.0,0,0,SOTON/O.Q. 3101310,7.0500,NaN,S,0,35.0,38.0,3,35.0,35.0
1,60,3,"Goodwin, Master. William Frederick",male,11.0,5,2,CA 2144,46.9000,NaN,S,0,13.0,14.0,5,13.0,9.0
2,796,2,"Otter, Mr. Richard",male,39.0,0,0,28213,13.0000,NaN,S,0,39.0,41.0,2,39.0,39.0
3,738,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C,1,35.0,36.0,1,35.0,35.0
4,842,2,"Mudd, Mr. Thomas Charles",male,16.0,0,0,S.O./P.P. 3,10.5000,NaN,S,0,16.0,18.0,2,16.0,16.0